local ToWString = userMods.ToWString
local FromWString = userMods.FromWString
-- interface module
Global("locales", {})
--------------------------------------------------------------------------------
--------------------------------- Russian --------------------------------------
--------------------------------------------------------------------------------

locales["rus"] = {
    ["locName"] = "Колизей Хранителя",
    ["startMsg"] = "запущен.",
    ["impassable"] = "Не проходимый:",
    ["passable"] = "Проходимый:",

    ["states"] = {
        ["ИзиХран проходится даже с тупящими рандомами"] = 0,
        ["Проходится довольно легко если никто не тупит"] = 1,
        ["Сложный и лучше пропустить."] = 2,
        ["Можно не залутать сундук хилом, если на момент смерти на нём (хиле) висит безмолвие на момент смерти храна. На 10-20% храна выпить яд и умереть."] = 3,
        ["Слышал что убивается, но мне не попадался чтобы попробовать."] = 4
    },

    ["defenders"] = {
        -- HARD
        ["Айронмен"] = {
            ["state"] = "2",
            ["guild"] = "Айронболз",
            ["info"] = "",
            ["state_title"] = "Сложный и лучше пропустить."
        },
        ["Ангелочек"] = {
            ["state"] = "2",
            ["guild"] = "Лига",
            ["info"] = "",
            ["state_title"] = "Сложный и лучше пропустить."
        },
        ["Астарот"] = {
            ["state"] = "2",
            ["guild"] = "Ревенджерс",
            ["info"] = "",
            ["state_title"] = "Сложный и лучше пропустить."
        },
        ["Брысъ"] = {
            ["state"] = "3",
            ["guild"] = "",
            ["info"] = "Дебаф на снижение исцеления на хила (при чистке снимает 90%хп). Чистить ярость с него. Кайтить из луж. Вешает безмолвие (можно хилить только в столбах).",
            ["state_title"] = "Можно не залутать сундук хилом, если на момент смерти на нём (хиле) висит безмолвие на момент смерти храна. На 10-20% храна выпить яд и умереть."
        },
        ["Варяг"] = {
            ["state"] = "2",
            ["guild"] = "",
            ["info"] = "",
            ["state_title"] = "Сложный и лучше пропустить."
        },
        ["Володяледокол"] = {
            ["state"] = "2",
            ["guild"] = "Чеверный фронт",
            ["info"] = "",
            ["state_title"] = "Сложный и лучше пропустить."
        },
        ["Диктатор"] = {
            ["state"] = "2",
            ["guild"] = "Северная Корея",
            ["info"] = "Лужи, созвездия, узы.",
            ["state_title"] = "Сложный и лучше пропустить."
        },
        ["Зверюга"] = {
            ["state"] = "2",
            ["guild"] = "Армагеддон",
            ["info"] = "",
            ["state_title"] = "Сложный и лучше пропустить."
        },
        ["Квант"] = {
            ["state"] = "0",
            ["guild"] = "",
            ["info"] = "Болванчик, Вскипание крови не чистить, Эссенции",
            ["state_title"] = "ИзиХран проходится даже с тупящими рандомами"
        },
        ["Комитетчик"] = {
            ["state"] = "0",
            ["guild"] = "Совет Империи",
            ["info"] = "Просто болванчик который травит (можно не чистить)",
            ["state_title"] = "ИзиХран проходится даже с тупящими рандомами"
        },
        ["Кронос"] = {
            ["state"] = "2",
            ["guild"] = "Время",
            ["info"] = "",
            ["state_title"] = "Сложный и лучше пропустить."
        },
        ["Куколд"] = {
            ["state"] = "2",
            ["guild"] = "",
            ["info"] = "",
            ["state_title"] = "Сложный и лучше пропустить."
        },
        ["Люцифер"] = {
            ["state"] = "1",
            ["guild"] = "Неба жители",
            ["info"] = "",
            ["state_title"] = "Проходится довольно легко если никто не тупит"
        },
        ["Можноливать"] = {
            ["state"] = "2",
            ["guild"] = "Без коментариев",
            ["info"] = "",
            ["state_title"] = "Сложный и лучше пропустить."
        },
        ["Мопкеу"] = {
            ["state"] = "0",
            ["guild"] = "",
            ["info"] = "Просто болванчик который травит (можно не чистить)",
            ["state_title"] = "ИзиХран проходится даже с тупящими рандомами"
        },
        ["Пересбор"] = {
            ["state"] = "2",
            ["guild"] = "Валгалла",
            ["info"] = "",
            ["state_title"] = "Сложный и лучше пропустить."
        },
        ["Повариха"] = {
            ["state"] = "2",
            ["guild"] = "Пту",
            ["info"] = "",
            ["state_title"] = "Сложный и лучше пропустить."
        },
        ["Пророксанбой"] = {
            ["state"] = "1",
            ["guild"] = "Золотая орда",
            ["info"] = "",
            ["state_title"] = "Проходится довольно легко если никто не тупит"
        },
        ["Птаха"] = {
            ["state"] = "2",
            ["guild"] = "Смерш",
            ["info"] = "",
            ["state_title"] = "Сложный и лучше пропустить."
        },
        ["Седойдемон"] = {
            ["state"] = "1",
            ["guild"] = "",
            ["info"] = "Лужи, созвездия, узы.",
            ["state_title"] = "Проходится довольно легко если никто не тупит"
        },
        ["Срулик"] = {
            ["state"] = "1",
            ["guild"] = "Триумвират",
            ["info"] = "Какой-то каст нужно сбивать чтобы на танка не повесил Кровавую метку и не начал отхил от ударов по нему.",
            ["state_title"] = "Проходится довольно легко если никто не тупит"
        },
        ["Стикс"] = {
            ["state"] = "2",
            ["guild"] = "",
            ["info"] = "",
            ["state_title"] = "Сложный и лучше пропустить."
        },
        ["Титанвероны"] = {
            ["state"] = "2",
            ["guild"] = "Каэртаген",
            ["info"] = "",
            ["state_title"] = "Сложный и лучше пропустить."
        },
        ["Хантер"] = {
            ["state"] = "2",
            ["guild"] = "",
            ["info"] = "",
            ["state_title"] = "Сложный и лучше пропустить."
        },
        ["Челмедведосвин"] = {
            ["state"] = "0",
            ["guild"] = "Южный парк",
            ["info"] = "Нужно кайтить, в остальном изи.",
            ["state_title"] = "ИзиХран проходится даже с тупящими рандомами"
        },
        ["Ярость"] = {
            ["state"] = "3",
            ["guild"] = "",
            ["info"] = "Вешает безмолвие (можно хилить только в столбах).",
            ["state_title"] = "Можно не залутать сундук хилом, если на момент смерти на нём (хиле) висит безмолвие на момент смерти храна. На 10-20% храна выпить яд и умереть."
        },
        -- HARD

        -- NORAML
        ["Аим"] = {
            ["state"] = "0",
            ["guild"] = "",
            ["info"] = "Кидает дебаф с периодическим уроном (кровь). Можно не чистить или только по одному. При чистке наносит АоЕ урон, Эссенции",
            ["state_title"] = "ИзиХран проходится даже с тупящими рандомами"
        },
        ["Айнзоулгон"] = {
            ["state"] = "0",
            ["guild"] = "",
            ["info"] = "болванчик",
            ["state_title"] = "ИзиХран проходится даже с тупящими рандомами"
        },
        ["Айнцолгон"] = {
            ["state"] = "2",
            ["guild"] = "",
            ["info"] = "",
            ["state_title"] = "Сложный и лучше пропустить."
        },
        ["Банхаммер"] = {
            ["state"] = "2",
            ["guild"] = "",
            ["info"] = "",
            ["state_title"] = "Сложный и лучше пропустить."
        },
        ["Бассо"] = {
            ["state"] = "2",
            ["guild"] = "",
            ["info"] = "",
            ["state_title"] = "Сложный и лучше пропустить."
        },
        ["Бобик"] = {
            ["state"] = "4",
            ["guild"] = "",
            ["info"] = "Кидает под игроков лужи которые хилят храна. Кидает дефаф (щит) на случайных игроков который станит тех кто в него попадает.",
            ["state_title"] = "Слышал что убивается, но мне не попадался чтобы попробовать."
        },
        ["Буся"] = {
            ["state"] = "2",
            ["guild"] = "",
            ["info"] = "",
            ["state_title"] = "Сложный и лучше пропустить."
        },
        ["Весемир"] = {
            ["state"] = "2",
            ["guild"] = "",
            ["info"] = "",
            ["state_title"] = "Сложный и лучше пропустить."
        },
        ["Витольдчемпион"] = {
            ["state"] = "2",
            ["guild"] = "",
            ["info"] = "Искры",
            ["state_title"] = "Сложный и лучше пропустить."
        },
        ["Геликаннн"] = {
            ["state"] = "4",
            ["guild"] = "",
            ["info"] = "Лужи созвездия вскипание крови",
            ["state_title"] = "Слышал что убивается, но мне не попадался чтобы попробовать."
        },
        ["Героймарвел"] = {
            ["state"] = "2",
            ["guild"] = "",
            ["info"] = "Кровавый пакт и магия крови  сбивать каст",
            ["state_title"] = "Сложный и лучше пропустить."
        },
        ["Гнагмутог"] = {
            ["state"] = "4",
            ["guild"] = "",
            ["info"] = "Делает разбежки в случайного игрока и шотает, если не увернуться.",
            ["state_title"] = "Слышал что убивается, но мне не попадался чтобы попробовать."
        },
        ["Гризли"] = {
            ["state"] = "0",
            ["guild"] = "",
            ["info"] = "Дебаф на снижение исцеления на хила (при чистке снимает 95%хп). Чистить ярость с него. Кайтить из луж.",
            ["state_title"] = "ИзиХран проходится даже с тупящими рандомами"
        },
        ["Гринёв"] = {
            ["state"] = "2",
            ["guild"] = "",
            ["info"] = "",
            ["state_title"] = "Сложный и лучше пропустить."
        },
        ["Демиург"] = {
            ["state"] = "2",
            ["guild"] = "Инквизиция",
            ["info"] = "Рывки",
            ["state_title"] = "Сложный и лучше пропустить."
        },
        ["Деструкт"] = {
            ["state"] = "2",
            ["guild"] = "Паритет",
            ["info"] = "",
            ["state_title"] = "Сложный и лучше пропустить."
        },
        ["Зверюга"] = {
            ["state"] = "2",
            ["guild"] = "",
            ["info"] = "",
            ["state_title"] = "Сложный и лучше пропустить."
        },
        ["Знаменосец"] = {
            ["state"] = "2",
            ["guild"] = "",
            ["info"] = "",
            ["state_title"] = "Сложный и лучше пропустить."
        },
        ["Кискасофы"] = {
            ["state"] = "0",
            ["guild"] = "",
            ["info"] = "Эсенции. Просто болванчик.",
            ["state_title"] = "ИзиХран проходится даже с тупящими рандомами"
        },
        ["Кроха"] = {
            ["state"] = "0",
            ["guild"] = "",
            ["info"] = "Нельзя останавливаться.",
            ["state_title"] = "ИзиХран проходится даже с тупящими рандомами"
        },
        ["Курама"] = {
            ["state"] = "2",
            ["guild"] = "Эндлес",
            ["info"] = "Безмолвие чистить. Хилится в своей луже.",
            ["state_title"] = "Сложный и лучше пропустить."
        },
        ["Лаит"] = {
            ["state"] = "0",
            ["guild"] = "",
            ["info"] = "Призывает эсенции (нужно сливать), в остальном столб.",
            ["state_title"] = "ИзиХран проходится даже с тупящими рандомами"
        },
        ["Медив"] = {
            ["state"] = "4",
            ["guild"] = "Кракен",
            ["info"] = "Лужи, созвездия, кровь не чисттить.",
            ["state_title"] = "Слышал что убивается, но мне не попадался чтобы попробовать."
        },
        ["Миллиардр"] = {
            ["state"] = "2",
            ["guild"] = "",
            ["info"] = "",
            ["state_title"] = "Сложный и лучше пропустить."
        },
        ["Негатив"] = {
            ["state"] = "2",
            ["guild"] = "",
            ["info"] = "Рывки",
            ["state_title"] = "Сложный и лучше пропустить."
        },
        ["Плотва"] = {
            ["state"] = "2",
            ["guild"] = "",
            ["info"] = "",
            ["state_title"] = "Сложный и лучше пропустить."
        },
        ["Пьянымилтен"] = {
            ["state"] = "2",
            ["guild"] = "",
            ["info"] = "Эсенции. Созвездия. Вскипание крови.",
            ["state_title"] = "Сложный и лучше пропустить."
        },
        ["Рнагмутог"] = {
            ["state"] = "2",
            ["guild"] = "",
            ["info"] = "",
            ["state_title"] = "Сложный и лучше пропустить."
        },
        ["Секатор"] = {
            ["state"] = "2",
            ["guild"] = "",
            ["info"] = "",
            ["state_title"] = "Сложный и лучше пропустить."
        },
        ["Секира"] = {
            ["state"] = "0",
            ["guild"] = "",
            ["info"] = "Просто болванчик.",
            ["state_title"] = "ИзиХран проходится даже с тупящими рандомами"
        },
        ["Скарбранд"] = {
            ["state"] = "0",
            ["guild"] = "",
            ["info"] = "Лужи, Станящий шит, созвездия",
            ["state_title"] = "ИзиХран проходится даже с тупящими рандомами"
        },
        ["Старший брат"] = {
            ["state"] = "0",
            ["guild"] = "",
            ["info"] = "Болванчик. Периодически кидает вокруг себя отравление.",
            ["state_title"] = "ИзиХран проходится даже с тупящими рандомами"
        },
        ["Стражпирамид"] = {
            ["state"] = "2",
            ["guild"] = "",
            ["info"] = "",
            ["state_title"] = "Сложный и лучше пропустить."
        },
        ["Тегмуиатог"] = {
            ["state"] = "2",
            ["guild"] = "",
            ["info"] = "",
            ["state_title"] = "Сложный и лучше пропустить."
        },
        ["Тигра"] = {
            ["state"] = "2",
            ["guild"] = "",
            ["info"] = "Искры",
            ["state_title"] = "Сложный и лучше пропустить."
        },
        ["Фикссон"] = {
            ["state"] = "4",
            ["guild"] = "",
            ["info"] = "Лужи, созвездия, кровь не чисттить.",
            ["state_title"] = "Слышал что убивается, но мне не попадался чтобы попробовать."
        },
        ["Хомякгреха"] = {
            ["state"] = "4",
            ["guild"] = "",
            ["info"] = "Делает разбежки в случайного игрока и шотает.",
            ["state_title"] = "Слышал что убивается, но мне не попадался чтобы попробовать."
        },
        ["Хубабублин"] = {
            ["state"] = "2",
            ["guild"] = "Хубабублины",
            ["info"] = "",
            ["state_title"] = "Сложный и лучше пропустить."
        },
        ["Циркулярка"] = {
            ["state"] = "2",
            ["guild"] = "",
            ["info"] = "",
            ["state_title"] = "Сложный и лучше пропустить."
        },
        ["Чиллотрон"] = {
            ["state"] = "2",
            ["guild"] = "",
            ["info"] = "",
            ["state_title"] = "Сложный и лучше пропустить."
        },
        ["Чулочки"] = {
            ["state"] = "0",
            ["guild"] = "",
            ["info"] = "Просто болванчик.",
            ["state_title"] = "ИзиХран проходится даже с тупящими рандомами"
        }
        -- NORAML

        -- ["Страж"] = {["state"] = true, ["info"] = "текст"},
    }
}

--------------------------------------------------------------------------------

--------------------------------------------------------------------------------
--------------------------------- English --------------------------------------
--------------------------------------------------------------------------------

locales["eng_eu"] = {}

--------------------------------------------------------------------------------
-----
--------------------------------------------------------------------------------

-- put locales used by client
locales = locales["rus"]
-- locales = locales[common.GetLocalization()] or locales["eng_eu"]

-- temporary to have en on ru
-- locales = locales["eng_eu"]
-- temporary to have ru on en
-- locales = locales["rus"]
